# SetServicesToLoad Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..SetServicesToLoad Method
FabricationConfiguration Class See Also
---
Sets the services which are to be loaded or not next time reloadConfiguration is called. If a service is not included but is currently loaded then it will be unloaded then.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool SetServicesToLoad(
	IList<int> serviceIds
)
```

Visual Basic
---
```text
Public Function SetServicesToLoad ( _
	serviceIds As IList(Of Integer) _
) As Boolean
```

Visual C++
---
```text
public:
bool SetServicesToLoad(
	IList<int>^ serviceIds
)
```

# ### Parameters
serviceIds
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)>
# ### Return Value
Returns true if successful. May fail if any service currently loaded is not included and is in use so cannot be unloaded.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace